; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_6 ?v11 ?v8)
             (pred_1 ?v2 ?v9)
             (pred_12 ?v11 ?v9)
             (pred_5 ?v3 ?v11 )
	     (pred_3 ?v11)
             (pred_9 ?v13)
             (pred_11 ?v2)
             (pred_4 ?v9)
             (pred_2 ?v11)
             (pred_8 ?v2)
             (pred_10 ?v11)
             (pred_7 ))



(:action op_3
:parameters (?v12 ?v5 ?v1 ?v7)
:precondition (and (pred_9 ?v12) (pred_9 ?v5) (pred_11 ?v1) (pred_4 ?v7)
          (pred_6 ?v12 ?v5) (pred_1 ?v1 ?v7)
                   (pred_12 ?v5 ?v7) (pred_3 ?v12) 
                   (pred_2 ?v5) (pred_8 ?v1))
:effect (and  (pred_10 ?v5) (not (pred_2 ?v5))))


(:action op_4
:parameters (?v12 ?v6)
:precondition (and (pred_9 ?v12) (pred_9 ?v6)
               (pred_3 ?v12) (pred_6 ?v12 ?v6) (pred_10 ?v6))
:effect (and (pred_3 ?v6) (not (pred_3 ?v12))))

(:action op_2
:parameters (?v12 ?v1)
:precondition (and (pred_9 ?v12) (pred_11 ?v1) 
                  (pred_3 ?v12) (pred_5 ?v1 ?v12) (pred_7 ))
:effect (and (pred_8 ?v1)
   (not (pred_5 ?v1 ?v12)) (not (pred_7 ))))


(:action op_5
:parameters (?v12 ?v4 ?v10)
:precondition (and (pred_9 ?v12) (pred_11 ?v4) (pred_11 ?v10)
                  (pred_3 ?v12) (pred_8 ?v10) (pred_5 ?v4 ?v12))
:effect (and (pred_8 ?v4) (pred_5 ?v10 ?v12)
        (not (pred_8 ?v10)) (not (pred_5 ?v4 ?v12))))

(:action op_1
:parameters (?v12 ?v1)
:precondition (and (pred_9 ?v12) (pred_11 ?v1) 
                  (pred_3 ?v12) (pred_8 ?v1))
:effect (and (pred_7 ) (pred_5 ?v1 ?v12) (not (pred_8 ?v1)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_01 obj_17 obj_03 obj_11 obj_15 obj_04 obj_22 obj_05 obj_12 obj_30 obj_09 obj_06 obj_18 obj_26 obj_27 obj_07 obj_08 obj_10 obj_28 obj_14 obj_20 obj_16 obj_24 obj_13
    obj_29 obj_25
    obj_02 obj_19 obj_21
    )

    (:init
       (pred_7)

       (pred_9 obj_23)
       (pred_9 obj_01)
       (pred_9 obj_17)
       (pred_9 obj_03)
       (pred_9 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_22)
       (pred_9 obj_05)
       (pred_9 obj_12)
       (pred_9 obj_30)
       (pred_9 obj_09)
       (pred_9 obj_06)
       (pred_9 obj_18)
       (pred_9 obj_26)
       (pred_9 obj_27)
       (pred_9 obj_07)
       (pred_9 obj_08)
       (pred_9 obj_10)
       (pred_9 obj_28)
       (pred_9 obj_14)
       (pred_9 obj_20)
       (pred_9 obj_16)
       (pred_9 obj_24)
       (pred_9 obj_13)
       (pred_4 obj_29)
       (pred_4 obj_25)
       (pred_11 obj_02)
       (pred_11 obj_19)
       (pred_11 obj_21)

       (pred_6 obj_23 obj_15)
       (pred_6 obj_23 obj_01)
       (pred_6 obj_01 obj_04)
       (pred_6 obj_01 obj_17)
       (pred_6 obj_01 obj_23)
       (pred_6 obj_17 obj_22)
       (pred_6 obj_17 obj_03)
       (pred_6 obj_17 obj_01)
       (pred_6 obj_03 obj_05)
       (pred_6 obj_03 obj_11)
       (pred_6 obj_03 obj_17)
       (pred_6 obj_11 obj_12)
       (pred_6 obj_11 obj_03)
       (pred_6 obj_15 obj_30)
       (pred_6 obj_15 obj_04)
       (pred_6 obj_15 obj_23)
       (pred_6 obj_04 obj_09)
       (pred_6 obj_04 obj_22)
       (pred_6 obj_04 obj_01)
       (pred_6 obj_04 obj_15)
       (pred_6 obj_22 obj_06)
       (pred_6 obj_22 obj_05)
       (pred_6 obj_22 obj_17)
       (pred_6 obj_22 obj_04)
       (pred_6 obj_05 obj_18)
       (pred_6 obj_05 obj_12)
       (pred_6 obj_05 obj_03)
       (pred_6 obj_05 obj_22)
       (pred_6 obj_12 obj_26)
       (pred_6 obj_12 obj_11)
       (pred_6 obj_12 obj_05)
       (pred_6 obj_30 obj_27)
       (pred_6 obj_30 obj_09)
       (pred_6 obj_30 obj_15)
       (pred_6 obj_09 obj_07)
       (pred_6 obj_09 obj_06)
       (pred_6 obj_09 obj_04)
       (pred_6 obj_09 obj_30)
       (pred_6 obj_06 obj_08)
       (pred_6 obj_06 obj_18)
       (pred_6 obj_06 obj_22)
       (pred_6 obj_06 obj_09)
       (pred_6 obj_18 obj_10)
       (pred_6 obj_18 obj_26)
       (pred_6 obj_18 obj_05)
       (pred_6 obj_18 obj_06)
       (pred_6 obj_26 obj_28)
       (pred_6 obj_26 obj_12)
       (pred_6 obj_26 obj_18)
       (pred_6 obj_27 obj_14)
       (pred_6 obj_27 obj_07)
       (pred_6 obj_27 obj_30)
       (pred_6 obj_07 obj_20)
       (pred_6 obj_07 obj_08)
       (pred_6 obj_07 obj_09)
       (pred_6 obj_07 obj_27)
       (pred_6 obj_08 obj_16)
       (pred_6 obj_08 obj_10)
       (pred_6 obj_08 obj_06)
       (pred_6 obj_08 obj_07)
       (pred_6 obj_10 obj_24)
       (pred_6 obj_10 obj_28)
       (pred_6 obj_10 obj_18)
       (pred_6 obj_10 obj_08)
       (pred_6 obj_28 obj_13)
       (pred_6 obj_28 obj_26)
       (pred_6 obj_28 obj_10)
       (pred_6 obj_14 obj_20)
       (pred_6 obj_14 obj_27)
       (pred_6 obj_20 obj_16)
       (pred_6 obj_20 obj_07)
       (pred_6 obj_20 obj_14)
       (pred_6 obj_16 obj_24)
       (pred_6 obj_16 obj_08)
       (pred_6 obj_16 obj_20)
       (pred_6 obj_24 obj_13)
       (pred_6 obj_24 obj_10)
       (pred_6 obj_24 obj_16)
       (pred_6 obj_13 obj_28)
       (pred_6 obj_13 obj_24)
       (pred_2 obj_26)
       (pred_2 obj_17)
       (pred_2 obj_13)
       (pred_12  obj_26 obj_29)
       (pred_12  obj_17 obj_25)
       (pred_12  obj_13 obj_29)
       (pred_10 obj_23)
       (pred_10 obj_01)
       (pred_10 obj_03)
       (pred_10 obj_11)
       (pred_10 obj_15)
       (pred_10 obj_04)
       (pred_10 obj_22)
       (pred_10 obj_05)
       (pred_10 obj_12)
       (pred_10 obj_30)
       (pred_10 obj_09)
       (pred_10 obj_06)
       (pred_10 obj_18)
       (pred_10 obj_27)
       (pred_10 obj_07)
       (pred_10 obj_08)
       (pred_10 obj_10)
       (pred_10 obj_28)
       (pred_10 obj_14)
       (pred_10 obj_20)
       (pred_10 obj_16)
       (pred_10 obj_24)

       (pred_1  obj_02 obj_29)
       (pred_1  obj_19 obj_25)
       (pred_1  obj_21 obj_25)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_19 obj_12)
       (pred_5 obj_21 obj_23)
       (pred_3 obj_09)
    )

    (:goal (and
       (pred_5 obj_02 obj_26)
       (pred_5 obj_21 obj_22)
    ))
(:constraints
  (always (not (pred_3 obj_04)))
)
)

; plan
1. (op_4 obj_09 obj_06)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_06)
   goals met: 0 of 2
2. (op_2 obj_06 obj_02)
   deleted: (pred_5 obj_02 obj_06) (pred_7)
   added: (pred_8 obj_02)
   goals met: 0 of 2
3. (op_4 obj_06 obj_18)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_18)
   goals met: 0 of 2
4. (op_3 obj_18 obj_26 obj_02 obj_29)
   deleted: (pred_2 obj_26)
   added: (pred_10 obj_26)
   goals met: 0 of 2
5. (op_4 obj_18 obj_26)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_26)
   goals met: 0 of 2
6. (op_1 obj_26 obj_02)
   deleted: (pred_8 obj_02)
   added: (pred_7) (pred_5 obj_02 obj_26)
   goals met: 1 of 2
7. (op_4 obj_26 obj_18)
   deleted: (pred_3 obj_26)
   added: (pred_3 obj_18)
   goals met: 1 of 2
8. (op_4 obj_18 obj_06)
   deleted: (pred_3 obj_18)
   added: (pred_3 obj_06)
   goals met: 1 of 2
9. (op_4 obj_06 obj_09)
   deleted: (pred_3 obj_06)
   added: (pred_3 obj_09)
   goals met: 1 of 2
10. (op_4 obj_09 obj_30)
   deleted: (pred_3 obj_09)
   added: (pred_3 obj_30)
   goals met: 1 of 2
11. (op_4 obj_30 obj_15)
   deleted: (pred_3 obj_30)
   added: (pred_3 obj_15)
   goals met: 1 of 2
12. (op_4 obj_15 obj_23)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_23)
   goals met: 1 of 2
13. (op_2 obj_23 obj_21)
   deleted: (pred_5 obj_21 obj_23) (pred_7)
   added: (pred_8 obj_21)
   goals met: 1 of 2
14. (op_4 obj_23 obj_01)
   deleted: (pred_3 obj_23)
   added: (pred_3 obj_01)
   goals met: 1 of 2
15. (op_3 obj_01 obj_17 obj_21 obj_25)
   deleted: (pred_2 obj_17)
   added: (pred_10 obj_17)
   goals met: 1 of 2
16. (op_4 obj_01 obj_17)
   deleted: (pred_3 obj_01)
   added: (pred_3 obj_17)
   goals met: 1 of 2
17. (op_4 obj_17 obj_22)
   deleted: (pred_3 obj_17)
   added: (pred_3 obj_22)
   goals met: 1 of 2
18. (op_1 obj_22 obj_21)
   deleted: (pred_8 obj_21)
   added: (pred_7) (pred_5 obj_21 obj_22)
   goals met: 2 of 2
